results/M2.0_0.00000000000/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    // default         Euler;
    // default         localEuler;
    // default         CrankNicolson 0.5;
    default         backward;
    // default        steadyState; // Steady state
}

gradSchemes
{
    // default         linear;
    default 	     cellLimited<cubic> 1.5 Gauss linear 1;
}

divSchemes
{
    default         none;
    div(phi,U)      Gauss upwind corrected; //Gauss linearUpwind grad(U); //Gauss upwind;
    div(phid,p)     Gauss upwind;
    div(phid,U)     Gauss upwind;
    div(phi,e)      Gauss upwind;
    div(phi,K)      Gauss upwind;
    div(phiv,p)     Gauss upwind;

    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
    // turbulence
    div(phi,k)      bounded Gauss upwind;
    div(phi,omega)  bounded Gauss upwind;
}

// turbulence
wallDist
{
    method meshWave;
}

laplacianSchemes
{
    default         Gauss linear corrected;//Gauss linear corrected;
    // default             Gauss linear; // improve speed
}

interpolationSchemes
{
    default         linear;
    // default         upwind;
}

snGradSchemes
{
    default         corrected;
}


// ************************************************************************* //
